In [1]:
import pandas as pd

In [8]:
#Para leer un archivo en excel dentro del pc, y podemos crear un fichero/estructura pandas usando el archivo
#Tenemos 3 columnas
dataframe = pd.read_csv('personas.csv')
#La informacion queda en esta var dataframe
dataframe

    NOMBRE          APELLIDOS  EDAD  SALARIO
0  ANTONIO        PEREZ GOMEZ    34    20000
1     LUIS  RODRIGUEZ VAZQUEZ    45    45000
2     ROSA     MARTINEZ LOPEZ    25    15000
3    PEDRO     SILVA GONZALEZ    54    50000
4    MARIA         DIAZ LOPEZ    40    32000

In [10]:
#con el metodo describe podemos ver la informacion del dataframe
dataframe.describe()

            EDAD       SALARIO
count   5.000000      5.000000
mean   39.600000  32400.000000
std    10.968136  15208.550227
min    25.000000  15000.000000
25%    34.000000  20000.000000
50%    40.000000  32000.000000
75%    45.000000  45000.000000
max    54.000000  50000.000000

In [13]:
#Asi podemos obtener informacion de una columna en especifico
dataframe['NOMBRE']

0    ANTONIO
1       LUIS
2       ROSA
3      PEDRO
4      MARIA
Name: NOMBRE, dtype: object

In [15]:
dataframe['NOMBRE'][0]

'ANTONIO'

In [20]:
#Lista de columnas
dataframe[['NOMBRE', 'APELLIDOS']]

    NOMBRE          APELLIDOS
0  ANTONIO        PEREZ GOMEZ
1     LUIS  RODRIGUEZ VAZQUEZ
2     ROSA     MARTINEZ LOPEZ
3    PEDRO     SILVA GONZALEZ
4    MARIA         DIAZ LOPEZ

In [21]:
#Para el maximo de salario...
dataframe['SALARIO'] > 30000

0    False
1     True
2    False
3     True
4     True
Name: SALARIO, dtype: bool

In [ ]:
filtro = dataframe['SALARIO'] > 30000
dataframe2 = dataframe[filtro]
dataframe2

In [27]:
#El dataframe se puede convertir en un array
dataframe2.values

array([['LUIS', 'RODRIGUEZ VAZQUEZ', 45, 45000],
       ['PEDRO', 'SILVA GONZALEZ', 54, 50000],
       ['MARIA', 'DIAZ LOPEZ', 40, 32000]], dtype=object)

In [29]:
array = dataframe2.values
array[0,1]

'RODRIGUEZ VAZQUEZ'